Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/edc/PIC32MK0512GPG064.PIC
      <edc:SFRDef edc:_addr="0x1F828210" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnrrnnnrrrcr" edc:cname="U2STA" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000100010000" edc:name="U2STA" edc:nzwidth="0x20" edc:por="00000000000000000000000100010000" edc:portals="CLR SET INV" ltx:memberofperipheral="UART2 UARTCD">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="URXDA" edc:desc="" edc:mask="0x1" edc:name="URXDA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="" edc:mask="0x1" edc:name="PERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RIDLE" edc:desc="" edc:mask="0x1" edc:name="RIDLE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="URXISEL" edc:desc="" edc:mask="0x3" edc:name="URXISEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXBF" edc:desc="" edc:mask="0x1" edc:name="UTXBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXEN" edc:desc="" edc:mask="0x1" edc:name="UTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXBRK" edc:desc="" edc:mask="0x1" edc:name="UTXBRK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="URXEN" edc:desc="" edc:mask="0x1" edc:name="URXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXINV" edc:desc="" edc:mask="0x1" edc:name="UTXINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXISEL" edc:desc="" edc:mask="0x3" edc:name="UTXISEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="" edc:mask="0xff" edc:name="ADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="" edc:mask="0xff" edc:name="MASK" edc:nzwidth="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="URXISEL0" edc:desc="" edc:mask="0x1" edc:name="URXISEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="URXISEL1" edc:desc="" edc:mask="0x1" edc:name="URXISEL1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UTXISEL0" edc:desc="" edc:mask="0x1" edc:name="UTXISEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXISEL1" edc:desc="" edc:mask="0x1" edc:name="UTXISEL1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xe"/>
            <edc:SFRFieldDef edc:cname="UTXSEL" edc:desc="" edc:mask="0x1" edc:name="UTXSEL" edc:nzwidth="0x2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F828220" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="2" edc:access="-----------------------nnnnnnnnn" edc:cname="U2TXREG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="U2TXREG" edc:nzwidth="0x20" edc:por="-----------------------000000000" edc:portals="- - -" ltx:memberofperipheral="UART2 UARTCD">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U2TXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U2TXREG" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F828230" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="2" edc:access="-----------------------rrrrrrrrr" edc:cname="U2RXREG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="U2RXREG" edc:nzwidth="0x20" edc:por="-----------------------000000000" edc:portals="- - -" ltx:memberofperipheral="UART2 UARTCD">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U2RXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U2RXREG" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F828240" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="2" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="U2BRG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="U2BRG" edc:nzwidth="0x20" edc:por="------------00000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="UART2 UARTCD">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BRG" edc:desc="" edc:mask="0xfffff" edc:name="BRG" edc:nzwidth="20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F828250" edc:offset="0x3db0"/>
      <edc:SFRDef edc:_addr="0x1F82C000" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-03554_cmp_control_upb_v2_32bit.Module" edc:_refcount="1" edc:access="-----------rrrrr--n--------rrrrr" edc:cname="CMSTAT" edc:desc="" edc:impl="0x1f201f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000--0--------00000" edc:name="CMSTAT" edc:nzwidth="32" edc:por="-----------00000--0--------00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C3OUT" edc:desc="" edc:mask="0x1" edc:name="C3OUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C4OUT" edc:desc="" edc:mask="0x1" edc:name="C4OUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C5OUT" edc:desc="" edc:mask="0x1" edc:name="C5OUT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="C1EVT" edc:desc="" edc:mask="0x1" edc:name="C1EVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C2EVT" edc:desc="" edc:mask="0x1" edc:name="C2EVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C3EVT" edc:desc="" edc:mask="0x1" edc:name="C3EVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C4EVT" edc:desc="" edc:mask="0x1" edc:name="C4EVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="C5EVT" edc:desc="" edc:mask="0x1" edc:name="C5EVT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CMP" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82C010" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-03554_cmp_control_upb_v2_32bit.Module" edc:_refcount="1" edc:access="nn-n--nn-nnnnnnnnnnn--nrnn-n--nn" edc:cname="CM1CON" edc:desc="" edc:impl="0xd37ff3d3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu-u--00-00000000000--0000-0--00" edc:name="CM1CON" edc:nzwidth="32" edc:por="xx-x--00-00000000000--0000-0--00" edc:portals="CLR SET INV" ltx:baseofperipheral="CMP1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CCH" edc:desc="" edc:mask="0x3" edc:name="CCH" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CREF" edc:desc="" edc:mask="0x1" edc:name="CREF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EVPOL" edc:desc="" edc:mask="0x3" edc:name="EVPOL" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="COUT" edc:desc="" edc:mask="0x1" edc:name="COUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CEVT" edc:desc="" edc:mask="0x1" edc:name="CEVT" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="OPLPWR" edc:desc="" edc:mask="0x1" edc:name="OPLPWR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="COE" edc:desc="" edc:mask="0x1" edc:name="COE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFDIV" edc:desc="" edc:mask="0x7" edc:name="CFDIV" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="CFLTREN" edc:desc="" edc:mask="0x1" edc:name="CFLTREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CFSEL" edc:desc="" edc:mask="0x7" edc:name="CFSEL" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="HYSSEL" edc:desc="" edc:mask="0x3" edc:name="HYSSEL" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HYSPOL" edc:desc="Comparator Hysteresis Polarity Selection" edc:mask="0x1" edc:name="HYSPOL" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Hysteresis on falling edge, rising edge is accurate" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Hysteresis on rising edge, falling edge is accurate" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENPGA" edc:desc="Opamp Fixed Gain Enable bit" edc:mask="0x1" edc:name="ENPGA" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Op amp is operating in Fixed Gain 1X mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Op amp is operating in Open Loop Mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OPAON" edc:desc="Opamp Enable Bit" edc:mask="0x1" edc:name="OPAON" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="Opamp Enabled and Connected to Pin" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Opamp is disabled and pin is released to other functions" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82C020" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-03554_cmp_control_upb_v2_32bit.Module" edc:_refcount="1" edc:access="----nnnnnnnnnnnnn-nnnnnnnnnnnnnn" edc:cname="CM1MSKCON" edc:desc="" edc:impl="0xfffbfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000000000000-00000000000000" edc:name="CM1MSKCON" edc:nzwidth="32" edc:por="----0000000000000-00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CMP1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AANEN" edc:desc="" edc:mask="0x1" edc:name="AANEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AAEN" edc:desc="" edc:mask="0x1" edc:name="AAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ABNEN" edc:desc="" edc:mask="0x1" edc:name="ABNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ABEN" edc:desc="" edc:mask="0x1" edc:name="ABEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACNEN" edc:desc="" edc:mask="0x1" edc:name="ACNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACEN" edc:desc="" edc:mask="0x1" edc:name="ACEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PAGS" edc:desc="" edc:mask="0x1" edc:name="PAGS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="NAGS" edc:desc="" edc:mask="0x1" edc:name="NAGS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OANEN" edc:desc="" edc:mask="0x1" edc:name="OANEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OAEN" edc:desc="" edc:mask="0x1" edc:name="OAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OBNEN" edc:desc="" edc:mask="0x1" edc:name="OBNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OBEN" edc:desc="" edc:mask="0x1" edc:name="OBEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCNEN" edc:desc="" edc:mask="0x1" edc:name="OCNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OCEN" edc:desc="" edc:mask="0x1" edc:name="OCEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="HLMS" edc:desc="" edc:mask="0x1" edc:name="HLMS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SELSRCA" edc:desc="" edc:mask="0xf" edc:name="SELSRCA" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="SELSRCB" edc:desc="" edc:mask="0xf" edc:name="SELSRCB" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="SELSRCC" edc:desc="" edc:mask="0xf" edc:name="SELSRCC" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
